Revit 2026 API

# ScheduleDefinitionCanFilterBySubstring Method

---

Checks whether a field can be used with a substring-based filter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanFilterBySubstring(
	ScheduleFieldId fieldId
)
```
```vb
Public Function CanFilterBySubstring (
	fieldId As ScheduleFieldId
) As Boolean
```
```cpp
public:
bool CanFilterBySubstring(
	ScheduleFieldId^ fieldId
)
```
```fsharp
member CanFilterBySubstring :
        fieldId : ScheduleFieldId -> bool
```

#### Parameters

fieldId ScheduleFieldId
     The ID of the field to check.

#### Return Value

Boolean True if the field can be used with a substring-based filter, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | fieldId is not the ID of a field in this ScheduleDefinition. |
| ArgumentNullException | A non-optional argument was null |

The substring-based filter types are Contains, NotContains, BeginsWith, NonBeginsWith, EndsWith and NotEndsWith.

Only string parameters can be filtered by substring.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace